In [1]:
import pandas as pd
import numpy as np

In [35]:
# NEED a new DV

353

In [3]:
Gov = pd.read_csv('Data/Clean/Political/Regime-Type.csv')
Gov.head()

       Country  Year  Gov
0  Afghanistan  1800   -6
1  Afghanistan  1801   -6
2  Afghanistan  1802   -6
3  Afghanistan  1803   -6
4  Afghanistan  1804   -6

In [4]:
BC = pd.read_csv('Data/Clean/Political/BC.csv')
BC.head()

       Country  Year    BC
0  Afghanistan  1946   8.0
1  Afghanistan  1947  20.0
2  Afghanistan  1948  14.0
3  Afghanistan  1949   8.0
4  Afghanistan  1950  16.0

In [5]:
PI = pd.read_csv('Data/Clean/Political/PI.csv')
PI.head()

       Country  Year PI
0  Afghanistan  1950  0
1  Afghanistan  1951  0
2  Afghanistan  1952  0
3  Afghanistan  1953  0
4  Afghanistan  1954  0

In [34]:
RPE = pd.read_csv('Data/Clean/Political/RPE.csv')
RPE.head()
len(RPE)

12036

In [7]:
FH = pd.read_csv('Data/Clean/Political/FH.csv')
FH.head()

               Country  Year PR CL
0              Algeria  1972  6  6
1              Andorra  1972  4  4
2               Angola  1972  -  -
3  Antigua and Barbuda  1972  -  -
4            Argentina  1972  6  6

In [8]:
# Checking PR and CL columns for different values
FH['PR'].unique()

array(['6', '4', '-', '1', '2', '7', '5', '3', '2(5)', nan], dtype=object)

In [9]:
FH['CL'].unique()

array(['6', '4', '-', '1', '2', '7', '5', '3', '2(5)', nan], dtype=object)

In [10]:
# Updating non-numeric values
FH.replace(['-', '2(5)'], np.nan, inplace=True)
FH['PR'].unique()

array(['6', '4', nan, '1', '2', '7', '5', '3'], dtype=object)

In [33]:
# Checking PR and CL columns for different values
FH['CL'].unique()
len(FH)

706350

In [12]:
Urban = pd.read_csv('Data/Clean/Political/Urbanization-Rate.csv')
Urban.head()

                       country  year      value
0                        Aruba  1960  50.776000
1  Africa Eastern and Southern  1960  14.563810
2                  Afghanistan  1960   8.401000
3   Africa Western and Central  1960  14.705391
4                       Angola  1960  10.435000

In [13]:
column_names = ['Country','Year','Urban']

In [32]:
Urban.columns = column_names
Urban.head()
len(Urban)

16758

In [15]:
FR = pd.read_csv('Data/Clean/Political/Fertility-Rate.csv')
FR.head()

                       country  year     value
0                        Aruba  1960  4.820000
1  Africa Eastern and Southern  1960  6.724125
2                  Afghanistan  1960  7.282000
3   Africa Western and Central  1960  6.458448
4                       Angola  1960  6.708000

In [16]:
new_column_names = ['Country','Year','Fertility']

In [17]:
FR.columns = new_column_names
FR.head()

                       Country  Year  Fertility
0                        Aruba  1960   4.820000
1  Africa Eastern and Southern  1960   6.724125
2                  Afghanistan  1960   7.282000
3   Africa Western and Central  1960   6.458448
4                       Angola  1960   6.708000

In [31]:
len(FR)

16758

In [36]:
# Storing all DataFrames in a list
dfs = [Gov, BC, PI, RPE, FH, Urban, FR]  # Add more DataFrames to this list

# Initialize the merged DataFrame with the first DataFrame in the list
main_df = dfs[0]

# Iteratively merge each DataFrame in the list
for df in dfs[1:]:
    main_df = pd.merge(main_df, df, on=['Country', 'Year'])

In [37]:
main_df.head()

   Country  Year  Gov   BC   PI    RPE PR CL   Urban  Fertility
0  Algeria  1972   -9  0.0    0  2.742  6  6  39.831      7.546
1  Algeria  1973   -9  0.0    0  2.642  6  6  39.997      7.491
2  Algeria  1974   -9  0.0    0  2.222  6  6  40.163      7.440
3  Algeria  1975   -9  6.0  250  2.711  7  7  40.330      7.373
4  Algeria  1976   -9  6.0    0  2.431  6  6  40.497      7.306

In [38]:
main_df['Country'].nunique()

5009

In [39]:
len(main_df)

136

In [43]:
main_df.to_csv('Data/Clean/Combined/Political-Data.csv', index = False)